Autodesk.Revit.DB.Leader.Elbow
Elbow point of the Leader.
Remarks:
This is the mid-point of the leader and its purpose depends on the
shape of the leader. For arc-shaped leaders it defines the radius
of the arc. For a kinked leader it divides the leader line and
shoulder line.
Note that straight-line leaders do not have an actual elbow; however,
the value can still be obtained, although it will always equal the current
anchor point. Consequently, an elbow point can be set even on a straight-line
leader, but doing so will automatically change the leader's shape property.
It is allowed to set the  Elbow point of a kinked leader to equal either
the end point or anchor point of the leader. Doing so will effectively
change the leader's shape to a straight line. However, the elbow of an arc
leader is never allowed to be placed on either the end or anchor point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
When setting this property: An arc leader may not have its Elbow point placed at the current position of the leader's Anchor or End point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The leader is not currently owned by a valid element. A probable reason for that
could be if the element has been independently deleted, or the leader has never
been properly initialized.

Autodesk.Revit.DB.Leader.End
End point of the Leader.
Remarks:
The End point is the leader's end that points to the object being annotated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
When setting this property: The leader's End point may not be placed at the current position of the Anchor or Elbow point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The leader is not currently owned by a valid element. A probable reason for that
could be if the element has been independently deleted, or the leader has never
been properly initialized.